---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArrayIterator.#ctor
source: html/13c15ed5-6f2c-eb21-cf02-49d187f6ede9.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public SlabShapeCreaseArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.